'''
author:fangchao
date:2019/10/10

content:淘宝商品翻页爬取
'''

import requests
import re


def getHTMLText(url):
    headers = {
        'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36'}
    # 从浏览器得到cookie,填入变量usercookies中
    usercookies = ''

    cookies = {}
    for i in usercookies.split(';'):
        name, value = i.strip().split('=', 1)
        cookies[name] = value
    try:
        r = requests.get(url, timeout=60, headers=headers, cookies=cookies)
        r.raise_for_status()
        r.encoding = r.apparent_encoding
        return r.text
    except:
        return ""


def parsePage(ilt, html):
    try:
        plt = re.findall(r'\"view_price\"\:\"[\d\.]*\"', html)
        tlt = re.findall(r'\"raw_title\"\:\".*?\"', html)
        for i in range(len(plt)):
            price = eval(plt[i].split(':')[1])
            title = eval(tlt[i].split(':')[1])
            ilt.append([price, title])
    except:
        print("")


def printGoodsList(ilt):
    tplt = "{:4}\t{:8}\t{:16}"
    print(tplt.format("序号", "价格", "商品名称"))
    count = 0
    for g in ilt:
        count += 1
        print(tplt.format(count, g[0], g[1]))


def main():
    goods = "书包"
    depth = 2
    start_url = "https://s.taobao.com/search?q=" + goods
    infoList = []
    for i in range(depth):
        try:
            url = start_url + '&s=' + str(44 * i)
            html = getHTMLText(url)
            parsePage(infoList, html)
        except:
            continue
    printGoodsList(infoList)


if __name__ == '__main__':
    main()

"""
序号  	价格      	商品名称            
   1	118.00  	kk树书包小学生男孩1-3-4-5年级儿童背包
   2	49.90   	迪卡侬官网新款户外双肩包登山旅行包男书包学生休闲女背包QUBP
   3	29.00   	小米双肩包米家小背包男女通用运动包日常休闲双肩包学生书包
   4	189.00  	C&A运动休闲双肩包男学生书包2019新款简约电脑背包CA200222580
   5	189.00  	C&A休闲多色双肩包女学生书包2019秋季新款电脑背包CA200223402
   6	559.00  	Fjallraven/北极狐双肩包kanken书包女户外旅行背包官方旗舰23510
   7	118.00  	kk树书包小学生女孩6-12周岁儿童1-3-6年级女童双肩背包护脊减负
   8	139.00  	瑞士双肩包男大容量休闲旅行电脑背包男士时尚潮流初中学生书包女
   9	149.00  	瑞士军刀瑞戈双肩背包瑞士中学生高中书包男初中生女大容量电脑包
  10	129.00  	uek小学生书包男孩女生1-3-6年级护脊双肩背包6-12岁轻便儿童书包
  11	119.00  	KK剑桥树书包小学生男孩1-3-5年级儿童6-12周岁男童双肩背包减负
  12	149.00  	鳄鱼男士双肩包商务休闲电脑帆布背包旅游旅行包简约时尚潮流书包
  13	68.00   	巴布豆旗舰店书包1-3年级护脊减负儿童书包男4-6小学生书包轻便
  14	68.00   	迪士尼书包小学生男女1-3-4-6年级米奇减负背包儿童书包8-10-12岁
  15	589.00  	双肩包男士背包商务休闲旅行背包防盗旅游包女大中学生书包电脑包
  16	89.00   	卡帝乐鳄鱼双肩包男士商务背包男女双肩包电脑旅行休闲大容量书包
  17	169.00  	瑞士军士刀双肩包男士瑞士大容量旅行背包中学生书包女商务电脑包
  18	169.00  	双肩包男背包瑞士军士刀商务大容量电脑包瑞士军刀旅行包学生书包
  19	149.00  	鳄鱼男士双肩包旅游旅行包商务休闲电脑帆布背包简约时尚潮流书包
  20	142.00  	七匹狼双肩包男大容量防水背包书包男包商务休闲旅行行李袋电脑包
  21	309.00  	瑞士军士刀瑞戈旅行双肩包瑞士书包大容量商务出差电脑背包男防盗
  22	138.00  	瑞士军刀双肩包男背包休闲商务旅行大容量瑞士书包高中生电脑男士
  23	118.00  	kk树书包小学生男孩1-3-4-5年级儿童背包女孩6-12周岁双肩包护脊
  24	59.00   	双肩包男士背包大容量旅行大学生电脑女时尚潮流高中初中学生书包
  25	89.00   	迪士尼书包小学生男童1-3-4五年级6-12周岁女孩儿童减负双肩背包
  26	697.00  	Herschel Supply Retreat经典色时尚潮流男女双肩包书包背包潮牌
  27	719.00  	北极狐laptop笔记本电脑包13/15/17英寸男女手提双肩背包学生书包
  28	142.00  	七匹狼双肩包男旅行多功能背包商务出差大容量轻便简约行旅包书包
  29	129.00  	小米双肩包简约休闲多功能书包男女笔记本电脑包时尚潮流旅行背包
  30	899.00  	挪威官方正品Beckmann小学生书包女男儿童护脊减压背包1-3年级
  31	384.00  	FILA斐乐童装男童女童双肩包小学生书包初中儿童背包中学生双肩包
  32	188.00  	书包小学生男童1-3-4-6年级牛津大学儿童6-12周岁一减负护脊女孩5
  33	59.80   	商务背包男士双肩包韩版潮流旅行包休闲女学生书包简约时尚电脑包
  34	478.00  	Herschel Supply City中号限量款双肩包女2019新款背包男书包时尚
  35	195.02  	国家地理背包女运动户外时尚双肩包男牛津布旅行防水学生情侣书包
  36	258.00  	电视剧款JanSport旗舰店官网杰斯伯双肩包时尚女书包背包男大容量
  37	199.00  	小米 米兔儿童书包 6-12岁男女小学生潮双肩背包幼儿园大容量背包
  38	879.00  	ELLE双肩包女新款背包82040时尚简约潮流双肩背包女小清新书包女
  39	179.00  	TYAKASHA塔卡沙郊游系列 男女学生上学户外旅行双肩包书包115/116
  40	129.00  	花花公子男士双肩包时尚潮流休闲高中学生书包大学生电脑旅行背包
  41	599.00  	Fion/菲安妮双肩包女2019新款小怪兽可爱学生书包 简约女士小背包
  42	58.00   	双肩包男士背包大学生大容量旅行电脑女时尚潮流高中初中学生书包
  43	429.00  	FION/菲安妮新款双肩包旅行包 女士拉链印花背包青年防水书包小包
  44	499.00  	Samsonite/新秀丽双肩包女小包背包 尼龙时尚潮流书包女ins风TQ4
  45	499.00  	CHARLES＆KEITH情书包CK2-80840128朋克粗链条拼色女士单肩包婚包
  46	299.00  	双肩包男士商务简约时尚大容量多功能书包旅行休闲笔记本电脑背包
  47	378.00  	tigerfamily儿童书包小学生一年级1-3 女男6岁耐磨减负护脊双肩包
  48	298.00  	BOPAI博牌电脑背包男户外旅行休闲双肩包商务书包出差多功能男包
  49	498.00  	Tiger Family护脊减负书包 小学生3-5年级儿童女12周岁男童背包
  50	378.00  	tigerfamily儿童书包小学生一年级1-3 女男6岁耐磨减负护脊双肩包
  51	169.00  	瑞士军士刀双肩包男大容量旅行包休闲女电脑背包初中高中学生书包
  52	499.00  	Samsonite/新秀丽2019新款双肩包女小包 尼龙时尚韩版高中书包TQ4
  53	398.00  	中学生书包男女大容量校园减负高中生初中生韩版简约大学生书包男
  54	89.00   	uek幼儿园书包儿童男童女孩宝宝1-3-5岁可爱卡通双肩背包潮小书包
  55	98.00   	迪士尼小学生书包女童1-3-4三四年级冰雪奇缘女孩儿童减负双肩包6
  56	589.00  	背包双肩包男商务防盗旅行背包电脑包休闲书包女多功能旅游双肩包
  57	159.00  	山猫吉咪书包小学生男一1-3年级4-6减负护脊女孩子儿童双肩包轻便
  58	189.00  	C&A运动休闲双肩包男学生书包2019新款简约电脑背包CA200222580
  59	119.00  	C＆A男式休闲潮流双肩包 新款拼接式背包学生书包CA200213274
  60	447.00  	Fjallraven/北极狐双肩包kanken mini 迷你情侣书包背包女23561
  61	997.00  	HerschelSupply Little America经典色旅游双肩包男女士背包书包
  62	559.00  	Fjallraven/北极狐书包kanken双肩包女中号户外包运动背包男23510
  63	697.00  	Herschel Supply Athletics系列 Kaine 时尚休闲双肩包 背包 书包
  64	499.00  	Samsonite/新秀丽2019新款双肩包女小包 时尚潮流百搭书包女TQ4
  65	149.00  	uek小学生书包男童1-3-6年级女幼儿园背包轻便可爱一年级儿童书包
  66	229.00  	uek小学生书包女3-4-6年级轻便大容量五六年级男生韩版儿童背包
  67	629.00  	Samsonite/新秀丽背包男双肩包 商务男士旅行包时尚潮流书包TQ5
  68	88.00   	迪士尼小学生书包1-3-6四年级男童美国队长蜘蛛侠男孩儿童双肩包8
  69	936.00  	美国正品代购tory burch女包TB真皮双肩包2017新款书包旅行背包
  70	359.00  	护脊减负中学生书包男女韩版初中生高中生大容量小学生书包男校园
  71	261.00  	上海迪士尼国内代购 达菲熊雪莉玫杰拉多尼星黛露双肩包书包吴昕
  72	169.00  	双肩包男 商务瑞士军刀电脑包瑞士背包旅游休闲旅行户外黑色书包
  73	388.00  	卓梵 阿玛尼背包男士帆布双肩包 时尚潮流大学生书包潮牌旅行男包
  74	149.00  	鳄鱼男士双肩包商务休闲电脑帆布背包旅游旅行包简约时尚潮流书包
  75	79.00   	HK双肩包男简约书包时尚潮流休闲电脑包旅行轻便高中生大学生背包
  76	258.00  	JanSport旗舰店官网杰斯伯双肩包女学生书包纯色男士女士背包T501
  77	129.00  	babycare宝宝入园书包婴 幼儿园小书包3岁男女儿童防走失背包可爱
  78	119.00  	韩国FA书包小学生女童1-3-4-6年级儿童双肩包6-12周岁可爱背包女
  79	189.00  	瑞戈瑞士双肩包男初中高中学生书包女旅行包休闲瑞士军刀背包户外
  80	169.00  	阿迪达斯男包女2019双肩背包小学初中高中大学生书包电脑包EE1087
  81	88.00   	迪士尼儿童书包女小学生三到六年级四轻便网红女童2019新款韩版五
  82	359.00  	澳洲MYD双肩包女韩版书包初中高中生大学生中学生简约ins风背包男
  83	128.00  	杯具熊儿童书包小学生1-3-5年级6女孩12岁男童幼儿园减负轻便背包
  84	218.00  	FILA/斐乐双肩包护脊儿童幼儿园小学生书包中学生初中年级背包
  85	109.00  	三美婴小学生书包女童男孩一二年级减负护脊超轻6-12岁儿童背书包
  86	99.00   	书包 小学生女童1-3-4-6年级男孩减负护脊轻便大容量儿童双肩包
  87	488.00  	香港tigerfamily小学生护脊书包 男女5-9年级初中学生减负双肩包
  88	69.00   	巴布豆小学生书包男孩1-3-4-6年级双肩护脊减负6-12周岁儿童书包
  89	79.00   	kk剑桥树书包小学生男孩6-12岁儿童双肩背包女1-3-5年级轻便护脊
  90	139.00  	阿迪达斯男包女包高中大学生书包电脑包旅行包户外运动双肩包背包
  91	149.00  	鳄鱼男士双肩包旅游旅行包商务休闲电脑帆布背包简约时尚潮流书包
  92	69.00   	迪士尼儿童书包小学生男童1-3一6年级6-12岁漫威书包男孩双肩背包
"""